{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report listing three gallery-related features and associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing purpose and behavior of each component and utility.",
  "frontend/index.css": "Tailwind base file defining OKLCH color variables, dark mode tokens, and global styling defaults.",
  "frontend/index.html": "HTML entry point loading the React app with basic metadata and root mount div.",
  "frontend/src/App.tsx": "Main app wrapper composing all sections, top navigation, music toggle, and background styling.",
  "frontend/src/components/Footer.tsx": "Footer showing a romantic quote and caffeine.ai attribution with dynamic year and hostname.",
  "frontend/src/components/MusicToggle.tsx": "Floating audio play/pause button managing a looping background track with tooltip guidance.",
  "frontend/src/components/sections/CountdownSection.tsx": "Countdown timer section showing live time remaining until Feb 18, 2026 with reveal animations.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with title, intro text, reveal animation, and button scrolling to the story section.",
  "frontend/src/components/sections/LoveNoteSection.tsx": "Animated section displaying a toggleable love note revealed by clicking a mail icon.",
  "frontend/src/components/sections/MemoryGallerySection.tsx": "Image gallery with modal dialogs showing enlarged photos and captions using scroll reveal animations.",
  "frontend/src/components/sections/OurStorySection.tsx": "Timeline-style section describing story milestones with animated entries and a closing quote.",
  "frontend/src/components/sections/ReasonsSection.tsx": "Grid list of reasons with icons and scroll-triggered animations.",
  "frontend/src/components/sections/SurpriseSection.tsx": "Password-gated surprise message that unlocks special content after correct input.",
  "frontend/src/components/TopNav.tsx": "Fixed responsive navigation bar with desktop links and mobile sheet menu using smooth scrolling.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor based on Internet Identity state.",
  "frontend/src/hooks/useCountdown.ts": "Hook providing a live countdown to a target date with time breakdown and completion flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks enabling login, identity management, and persistence via Internet Identity.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook detecting the user's reduced-motion preference via media query.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend-related React Query hooks.",
  "frontend/src/hooks/useScrollReveal.ts": "Hook revealing elements on scroll using IntersectionObserver with reduced-motion fallback.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH color variables for light/dark themes, global fonts, and various animation and gradient utility classes.",
  "frontend/src/lib/scrollToSection.ts": "Provides a smooth-scrolling function that offsets scroll position to account for a fixed header.",
  "frontend/src/main.tsx": "Initializes the React app root, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH-based color tokens, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Captures the project’s state, requirements, issues, and architectural notes for building a pastel-themed interactive personal website."
}